apache/nuttx/arch/arm/include/kinetis/chip.h
/************************************************************************************
 * arch/arm/include/kinetis/chip.h
 *
 *   Copyright (C) 2011, 2013, 2015 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

#ifndef __ARCH_ARM_INCLUDE_KINETIS_CHIP_H
#define __ARCH_ARM_INCLUDE_KINETIS_CHIP_H

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>

/************************************************************************************
 * Pre-processor Definitions
 ************************************************************************************/

/* Get customizations for each supported chip */

/* MK20DX/DN---VLH5
 *
 *  ------------- ------ --- ------- ------ ------- ------ ----- ----
 *  PART NUMBER   CPU    PIN PACKAGE TOTAL  PROGRAM EEPROM SRAM  GPIO
 *                FREQ   CNT         FLASH  FLASH
 *  ------------- ------ --- ------- ------ ------- ------ ----- ----
 *  MK20DN32VLH5  50 MHz 64  LQFP     32 KB 32 KB   —       8 KB 40
 *  MK20DX32VLH5  50 MHz 64  LQFP     64 KB 32 KB   2 KB    8 KB 40
 *  MK20DN64VLH5  50 MHz 64  LQFP     64 KB 64 KB   —      16 KB 40
 *  MK20DX64VLH5  50 MHz 64  LQFP     96 KB 64 KB   2 KB   16 KB 40
 *  MK20DN128VLH5 50 MHz 64  LQFP    128 KB 128 KB  —      16 KB 40
 *  MK20DX128VLH5 50 MHz 64  LQFP    160 KB 128 KB  2 KB   16 KB 40
 */

#if defined(CONFIG_ARCH_CHIP_MK20DN32VLH5) || \
    defined(CONFIG_ARCH_CHIP_MK20DX32VLH5) || \
    defined(CONFIG_ARCH_CHIP_MK20DN64VLH5) || \
    defined(CONFIG_ARCH_CHIP_MK20DX64VLH5) || \
    defined(CONFIG_ARCH_CHIP_MK20DN128VLH5) || \
    defined(CONFIG_ARCH_CHIP_MK20DX128VLH5)

#  define KINETIS_K20             1          /* Kinetics K20 family */
#  undef  KINETIS_K40                        /* Not Kinetics K40 family */
#  undef  KINETIS_K60                        /* Not Kinetis K60 family */

#if defined(CONFIG_ARCH_CHIP_MK20DN32VLH5)
#  define KINETIS_FLASH_SIZE      (64*1024)  /* 32Kb */
#  define KINETIS_FLEXMEM_SIZE    (0*1024)   /* No FlexMEM */
#  define KINETIS_SRAM_SIZE       (8*1024)   /* 8Kb */
#elif defined(CONFIG_ARCH_CHIP_MK20DX32VLH5)
#  define KINETIS_FLASH_SIZE      (64*1024)  /* 32Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)  /* 32Kb */
#  define KINETIS_SRAM_SIZE       (8*1024)   /* 8Kb */
#elif defined(CONFIG_ARCH_CHIP_MK20DN64VLH5)
#  define KINETIS_FLASH_SIZE      (64*1024)  /* 64Kb */
#  define KINETIS_FLEXMEM_SIZE    (0*1024)   /* No FlexMEM */
#  define KINETIS_SRAM_SIZE       (16*1024)  /* 16Kb */
#elif defined(CONFIG_ARCH_CHIP_MK20DX64VLH5)
#  define KINETIS_FLASH_SIZE      (64*1024)  /* 64Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)  /* 32Kb */
#  define KINETIS_SRAM_SIZE       (16*1024)  /* 16Kb */
#elif defined(CONFIG_ARCH_CHIP_MK20DN128VLH5)
#  define KINETIS_FLASH_SIZE      (128*1024) /* 128Kb */
#  define KINETIS_FLEXMEM_SIZE    (0*1024)   /* No FlexMEM */
#  define KINETIS_SRAM_SIZE       (16*1024)  /* 16Kb */
#elif defined(CONFIG_ARCH_CHIP_MK20DX128VLH5)
#  define KINETIS_FLASH_SIZE      (128*1024) /* 128Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)  /* 32Kb */
#  define KINETIS_SRAM_SIZE       (16*1024)  /* 16Kb */
#endif

#  undef  KINETIS_MPU                        /* No memory protection unit */
#  undef  KINETIS_EXTBUS                     /* No external bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                      /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  undef  KINETIS_NSDHC                      /* No SD host controller */
#  define KINETIS_NTOUCHIF        1          /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            1          /* One I2C modules */
#  undef  KINETIS_NISO7816                   /* No UART with ISO-786 */
#  define KINETIS_NUART           3          /* Three UARTs */
#  define KINETIS_NSPI            2          /* Two SPI modules */
#  undef  KINETIS_NCAN                       /* No CAN controllers */
#  define KINETIS_NI2S            1          /* One I2S module */
#  undef  KINETIS_NSLCD                      /* No segment LCD interface */
#  define KINETIS_NADC16          1          /* One 16-bit ADC */
#  undef  KINETIS_NADC12                     /* No 12-channel ADC */
#  undef  KINETIS_NADC13                     /* No 13-channel ADC */
#  undef  KINETIS_NADC15                     /* No 15-channel ADC */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            1          /* One Programmable Gain Amplifiers */
#  define KINETIS_NCMP            2          /* Two analog comparators */
#  define KINETIS_NDAC6           2          /* Two 6-bit DAC */
#  undef  KINETIS_NDAC12          0          /* No 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  define KINETIS_NTIMERS8        2          /* Two 2-8 channel FlexTimers */
#  undef  KINETIS_NTIMERS12                  /* No 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* One CRC */

/* MK20DX---VLH7
 *
 *  ------------- ------ --- ------- ------ ------- ------ ----- ----
 *  PART NUMBER   CPU    PIN PACKAGE TOTAL  PROGRAM EEPROM SRAM  GPIO
 *                FREQ   CNT         FLASH  FLASH
 *  ------------- ------ --- ------- ------ ------- ------ ----- ----
 *  MK20DX64VLH7  72 MHz 64  LQFP     96 KB  64 KB  2 KB   16 KB 40
 *  MK20DX128VLH7 72 MHz 64  LQFP    160 KB 128 KB  2 KB   32 KB 40
 *  MK20DX256VLH7 72 MHz 64  LQFP    288 KB 256 KB  2 KB   64 KB 40
 *  ------------- ------ --- ------- ------ ------- ------ ----- ----
 */

#elif defined(CONFIG_ARCH_CHIP_MK20DX64VLH7) || \
      defined(CONFIG_ARCH_CHIP_MK20DX128VLH7) || \
      defined(CONFIG_ARCH_CHIP_MK20DX256VLH7)

#  define KINETIS_K20             1          /* Kinetics K20 family */
#  undef  KINETIS_K40                        /* Not Kinetics K40 family */
#  undef  KINETIS_K60                        /* Not Kinetis K60 family */

#if defined(CONFIG_ARCH_CHIP_MK20DX64VLH7)
#  define KINETIS_FLASH_SIZE      (64*1024)  /* 64Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)  /* 32Kb */
#  define KINETIS_SRAM_SIZE       (16*1024)  /* 16Kb */
#elif defined(CONFIG_ARCH_CHIP_MK20DX128VLH7)
#  define KINETIS_FLASH_SIZE      (128*1024) /* 128Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)  /* 32Kb */
#  define KINETIS_SRAM_SIZE       (32*1024)  /* 32Kb */
#else /* if defined(CONFIG_ARCH_CHIP_MK20DX256VLH7) */
#  define KINETIS_FLASH_SIZE      (256*1024) /* 256Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)  /* 32Kb */
#  define KINETIS_SRAM_SIZE       (64*1024)  /* 64Kb */
#endif

#  undef  KINETIS_MPU                        /* No memory protection unit */
#  undef  KINETIS_EXTBUS                     /* No external bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                      /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  undef  KINETIS_NSDHC                      /* No SD host controller */
#  undef  KINETIS_NTOUCHIF                   /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2          /* Two I2C modules */
#  undef  KINETIS_NISO7816                   /* No UART with ISO-786 */
#  define KINETIS_NUART           3          /* Three UARTs */
#  define KINETIS_NSPI            1          /* One SPI module */
#  define KINETIS_NCAN            1          /* Two CAN controller */
#  define KINETIS_NI2S            1          /* One I2S module */
#  undef  KINETIS_NSLCD                      /* No segment LCD interface */
#  define KINETIS_NADC16          2          /* Two 16-bit ADC */
#  undef  KINETIS_NADC12                     /* No 12-channel ADC */
#  undef  KINETIS_NADC13                     /* No 13-channel ADC */
#  undef  KINETIS_NADC15                     /* No 15-channel ADC */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            2          /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  define KINETIS_NDAC6           3          /* Three 6-bit DAC */
#  define KINETIS_NDAC12          1          /* One 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  define KINETIS_NTIMERS12       2          /* Two 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  undef  KINETIS_NCRC                       /* No CRC */

#elif defined(CONFIG_ARCH_CHIP_MK40X64VFX50) || defined(CONFIG_ARCH_CHIP_MK40X64VLH50) || \
    defined(CONFIG_ARCH_CHIP_MK40X64VLK50) || defined(CONFIG_ARCH_CHIP_MK40X64VMB50)
#  undef  KINETIS_K20                        /* Not Kinetis K20 family */
#  define KINETIS_K40             1          /* Kinetics K40 family */
#  undef  KINETIS_K60                        /* Not Kinetis K60 family */
#  define KINETIS_FLASH_SIZE      (64*1024)  /* 64Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)  /* 32Kb */
#  define KINETIS_SRAM_SIZE       (16*1024)  /* 16Kb */
#  undef  KINETIS_MPU                        /* No memory protection unit */
#  undef  KINETIS_EXTBUS                     /* No external bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                      /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  undef  KINETIS_NSDHC                      /* No SD host controller */
#  undef  KINETIS_NTOUCHIF                   /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2          /* Two I2C modules */
#  undef  KINETIS_NISO7816                   /* No UART with ISO-786 */
#  define KINETIS_NUART           6          /* Six UARTs */
#  define KINETIS_NSPI            3          /* Three SPI modules */
#  if defined(CONFIG_ARCH_CHIP_MK40X64VLK50) || defined(CONFIG_ARCH_CHIP_MK40X64VMB50)
#    define KINETIS_NCAN          2          /* Two CAN controllers */
#  else
#    undef KINETIS_NCAN                      /* No CAN in 64-pin chips */
#  endif
#  define KINETIS_NI2S            1          /* One I2S module */
#  define KINETIS_NSLCD           1          /* One segment LCD interface (up to 25x8/29x4) */
#  define KINETIS_NADC16          4          /* Four 16-bit ADC */
#  undef  KINETIS_NADC12                     /* No 12-channel ADC */
#  undef  KINETIS_NADC13                     /* No 13-channel ADC */
#  undef  KINETIS_NADC15                     /* No 15-channel ADC */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            2          /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  define KINETIS_NDAC6           3          /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2          /* Two 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  define KINETIS_NTIMERS12       3          /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK40X128VFX50) || defined(CONFIG_ARCH_CHIP_MK40X128VLH50) || \
    defined(CONFIG_ARCH_CHIP_MK40X128VLK50) || defined(CONFIG_ARCH_CHIP_MK40X128VMB50) || \
    defined(CONFIG_ARCH_CHIP_MK40X128VLL50) || defined(CONFIG_ARCH_CHIP_MK40X128VML50) || \
    defined(CONFIG_ARCH_CHIP_MK40X128VFX72) || defined(CONFIG_ARCH_CHIP_MK40X128VLH72) || \
    defined(CONFIG_ARCH_CHIP_MK40X128VLK72) || defined(CONFIG_ARCH_CHIP_MK40X128VMB72) || \
    defined(CONFIG_ARCH_CHIP_MK40X128VLL72) || defined(CONFIG_ARCH_CHIP_MK40X128VML72)
#  undef  KINETIS_K20                        /* Not Kinetis K20 family */
#  define KINETIS_K40             1          /* Kinetics K40 family */
#  undef  KINETIS_K60                        /* Not Kinetis K60 family */
#  define KINETIS_FLASH_SIZE      (128*1024) /* 128Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)  /* 32Kb */
#  define KINETIS_SRAM_SIZE       (32*1024)  /* 32Kb */
#  undef  KINETIS_MPU                        /* No memory protection unit */
#  undef  KINETIS_EXTBUS                     /* No external bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                      /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  undef  KINETIS_NSDHC                      /* No SD host controller */
#  undef  KINETIS_NTOUCHIF                   /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2          /* Two I2C modules */
#  undef  KINETIS_NISO7816                   /* No UART with ISO-786 */
#  define KINETIS_NUART           6          /* Six UARTs */
#  define KINETIS_NSPI            3          /* Three SPI modules */
#  define KINETIS_NCAN            2          /* Two CAN controllers */
#  define KINETIS_NI2S            1          /* One I2S module */
#  define KINETIS_NSLCD           1          /* One segment LCD interface (up to 36x8/40x4) */
#  define KINETIS_NADC16          4          /* Four 16-bit ADC */
#  undef  KINETIS_NADC12                     /* No 12-channel ADC */
#  undef  KINETIS_NADC13                     /* No 13-channel ADC */
#  undef  KINETIS_NADC15                     /* No 15-channel ADC */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            2          /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  define KINETIS_NDAC6           3          /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2          /* Two 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  define KINETIS_NTIMERS12       3          /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK40X256VLK72) || defined(CONFIG_ARCH_CHIP_MK40X256VMB72) || \
    defined(CONFIG_ARCH_CHIP_MK40X256VLL72) || defined(CONFIG_ARCH_CHIP_MK40X256VML72)
#  undef  KINETIS_K20                        /* Not Kinetis K20 family */
#  define KINETIS_K40             1          /* Kinetics K40 family */
#  undef  KINETIS_K60                        /* Not Kinetis K60 family */
#  define KINETIS_FLASH_SIZE      (256*1024) /* 256Kb */
#  define KINETIS_FLEXMEM_SIZE    (32*1024)  /* 32Kb */
#  define KINETIS_SRAM_SIZE       (32*1024)  /* 64Kb */
#  undef  KINETIS_MPU                        /* No memory protection unit */
#  undef  KINETIS_EXTBUS                     /* No external bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                      /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  undef  KINETIS_NSDHC                      /* No SD host controller */
#  undef  KINETIS_NTOUCHIF                   /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2          /* Two I2C modules */
#  undef  KINETIS_NISO7816                   /* No UART with ISO-786 */
#  define KINETIS_NUART           6          /* Six UARTs */
#  define KINETIS_NSPI            3          /* Three SPI modules */
#  define KINETIS_NCAN            2          /* Two CAN controllers */
#  define KINETIS_NI2S            1          /* One I2S module */
#  define KINETIS_NSLCD           1          /* One segment LCD interface (up to 36x8/40x4) */
#  define KINETIS_NADC16          4          /* Four 16-bit ADC */
#  undef  KINETIS_NADC12                     /* No 12-channel ADC */
#  undef  KINETIS_NADC13                     /* No 13-channel ADC */
#  undef  KINETIS_NADC15                     /* No 15-channel ADC */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            2          /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  define KINETIS_NDAC6           3          /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2          /* Two 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  define KINETIS_NTIMERS12       3          /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK40X128VLQ100) || defined(CONFIG_ARCH_CHIP_MK40X128VMD100)
#  undef  KINETIS_K20                        /* Not Kinetis K20 family */
#  define KINETIS_K40             1          /* Kinetics K40 family */
#  undef  KINETIS_K60                        /* Not Kinetis K60 family */
#  define KINETIS_FLASH_SIZE      (128*1024) /* 128Kb */
#  define KINETIS_FLEXMEM_SIZE    (128*1024) /* 128Kb */
#  define KINETIS_SRAM_SIZE       (32*1024)  /* 32Kb */
#  define KINETIS_MPU             1          /* Memory protection unit */
#  define KINETIS_EXTBUS          1          /* External bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                      /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  define KINETIS_NSDHC           1          /* One SD host controller */
#  undef  KINETIS_NTOUCHIF                   /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2          /* Two I2C modules */
#  undef  KINETIS_NISO7816                   /* No UART with ISO-786 */
#  define KINETIS_NUART           6          /* Six UARTs */
#  define KINETIS_NSPI            3          /* Three SPI modules */
#  define KINETIS_NCAN            2          /* Two CAN controllers */
#  define KINETIS_NI2S            1          /* One I2S module */
#  define KINETIS_NSLCD           1          /* One segment LCD interface (up to 40x8/44x4)*/
#  define KINETIS_NADC16          4          /* Four 16-bit ADC */
#  undef  KINETIS_NADC12                     /* No 12-channel ADC */
#  undef  KINETIS_NADC13                     /* No 13-channel ADC */
#  undef  KINETIS_NADC15                     /* No 15-channel ADC */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            2          /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  define KINETIS_NDAC6           3          /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2          /* Two 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  define KINETIS_NTIMERS12       3          /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* CRC */

