apache/nuttx/arch/arm/include/kinetis/chip.h
#elif defined(CONFIG_ARCH_CHIP_MK40X256VLQ100) || defined(CONFIG_ARCH_CHIP_MK40X256VMD100)
#  undef  KINETIS_K20                        /* Not Kinetis K20 family */
#  define KINETIS_K40             1          /* Kinetics K40 family */
#  undef  KINETIS_K60                        /* Not Kinetis K60 family */
#  define KINETIS_FLASH_SIZE      (256*1024) /* 256Kb */
#  define KINETIS_FLEXMEM_SIZE    (256*1024) /* 256Kb */
#  define KINETIS_SRAM_SIZE       (64*1024)  /* 32Kb */
#  define KINETIS_MPU             1          /* Memory protection unit */
#  define KINETIS_EXTBUS          1          /* External bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                      /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  define KINETIS_NSDHC           1          /* One SD host controller */
#  undef  KINETIS_NTOUCHIF                   /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2          /* Two I2C modules */
#  undef  KINETIS_NISO7816                   /* No UART with ISO-786 */
#  define KINETIS_NUART           6          /* Six UARTs */
#  define KINETIS_NSPI            3          /* Three SPI modules */
#  define KINETIS_NCAN            2          /* Two CAN controllers */
#  define KINETIS_NI2S            1          /* One I2S module */
#  define KINETIS_NSLCD           1          /* One segment LCD interface (up to 40x8/44x4)*/
#  define KINETIS_NADC16          4          /* Four 16-bit ADC */
#  undef  KINETIS_NADC12                     /* No 12-channel ADC */
#  undef  KINETIS_NADC13                     /* No 13-channel ADC */
#  undef  KINETIS_NADC15                     /* No 15-channel ADC */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            2          /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  define KINETIS_NDAC6           3          /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2          /* Two 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  define KINETIS_NTIMERS12       3          /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK40N512VLK100) || defined(CONFIG_ARCH_CHIP_MK40N512VMB100) || \
      defined(CONFIG_ARCH_CHIP_MK40N512VLL100) || defined(CONFIG_ARCH_CHIP_MK40N512VML100) || \
      defined(CONFIG_ARCH_CHIP_MK40N512VLQ100) || defined(CONFIG_ARCH_CHIP_MK40N512VMD100)
#  undef  KINETIS_K20                        /* Not Kinetis K20 family */
#  define KINETIS_K40             1          /* Kinetics K40 family */
#  undef  KINETIS_K60                        /* Not Kinetis K60 family */
#  define KINETIS_FLASH_SIZE      (512*1024) /* 512Kb */
#  undef  KINETIS_FLEXMEM_SIZE               /* No FlexMemory */
#  define KINETIS_SRAM_SIZE       (128*1024) /* 128Kb */
#  define KINETIS_MPU             1          /* Memory protection unit */
#  define KINETIS_EXTBUS          1          /* External bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  undef  KINETIS_NENET                      /* No Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  define KINETIS_NSDHC           1          /* One SD host controller */
#  undef  KINETIS_NTOUCHIF                   /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            2          /* Two I2C modules */
#  undef  KINETIS_NISO7816                   /* No UART with ISO-786 */
#  define KINETIS_NUART           6          /* Six UARTs */
#  define KINETIS_NSPI            3          /* Three SPI modules */
#  define KINETIS_NCAN            2          /* Two CAN controllers */
#  define KINETIS_NI2S            1          /* One I2S module */
#  define KINETIS_NSLCD           1          /* One segment LCD interface (up to 40x8/44x4)*/
#  define KINETIS_NADC16          4          /* Four 16-bit ADC */
#  undef  KINETIS_NADC12                     /* No 12-channel ADC */
#  undef  KINETIS_NADC13                     /* No 13-channel ADC */
#  undef  KINETIS_NADC15                     /* No 15-channel ADC */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            2          /* Two Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  define KINETIS_NDAC6           3          /* Three 6-bit DAC */
#  define KINETIS_NDAC12          2          /* Two 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  define KINETIS_NTIMERS12       3          /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK60N256VLL100)
#  undef  KINETIS_K20                        /* Not Kinetis K20 family */
#  undef  KINETIS_K40                        /* Not Kinetics K40 family */
#  define KINETIS_K60             1          /* Kinetis K60 family */
#  define KINETIS_FLASH_SIZE      (256*1024) /* 256Kb */
#  undef  KINETIS_FLEXNVM_SIZE               /* No FlexNVM */
#  undef  KINETIS_FLEXRAM_SIZE               /* No FlexRAM */
#  define KINETIS_SRAM_SIZE       (64*1024)  /* 64Kb */
#  define KINETIS_MPU             1          /* Memory protection unit */
#  define KINETIS_EXTBUS          1          /* External bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  define KINETIS_NENET           1          /* One IEEE 1588 Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  define KINETIS_NSDHC           1          /* SD host controller */
#  define KINETIS_NTOUCHIF        1          /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            3          /* Three I2C modules */
#  define KINETIS_NISO7816        1          /* One UART with ISO-786 */
#  define KINETIS_NUART           4          /* Four additional UARTs */
#  define KINETIS_NSPI            3          /* Three SPI modules */
#  define KINETIS_NCAN            2          /* Two CAN controllers */
#  define KINETIS_NI2S            2          /* Two I2S modules */
#  define KINETIS_NSLCD           1          /* One segment LCD interface (up to 36x8/40x4) */
#  define KINETIS_NADC16          4          /* Four 16-bit ADC */
#  define KINETIS_NADC12          1          /* One 12-channel ADC (ADC0)*/
#  define KINETIS_NADC13          1          /* No 13-channel ADC (ADC1) */
#  undef  KINETIS_NADC15                     /* No 15-channel ADC */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            4          /* Four Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  undef  KINETIS_NDAC6                      /* No 6-bit DAC */
#  define KINETIS_NDAC12          1          /* One 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  undef  KINETIS_NTIMERS12                  /* No 12 channel timers */
#  define KINETIS_NTIMERS20       4          /* Four 20 channel timers */
#  define KINETIS_NTIMERS12       3          /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK60X256VLL100)
#  undef  KINETIS_K20                        /* Not Kinetis K20 family */
#  undef  KINETIS_K40                        /* Not Kinetics K40 family */
#  define KINETIS_K60             1          /* Kinetis K60 family */
#  define KINETIS_FLASH_SIZE      (256*1024) /* 256Kb */
#  define KINETIS_FLEXNVM_SIZE    (256*1024) /* 256Kb  */
#  define KINETIS_FLEXRAM_SIZE    (4*1024)   /* 32Kb */
#  define KINETIS_SRAM_SIZE       (64*1024)  /* 64Kb */
#  define KINETIS_MPU             1          /* Memory protection unit */
#  define KINETIS_EXTBUS          1          /* External bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  define KINETIS_NENET           1          /* One IEEE 1588 Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  define KINETIS_NSDHC           1          /* SD host controller */
#  define KINETIS_NTOUCHIF        1          /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            3          /* Three I2C modules */
#  define KINETIS_NISO7816        1          /* One UART with ISO-786 */
#  define KINETIS_NUART           4          /* Four additional UARTs */
#  define KINETIS_NSPI            3          /* Three SPI modules */
#  define KINETIS_NCAN            2          /* Two CAN controllers */
#  define KINETIS_NI2S            2          /* Two I2S modules */
#  define KINETIS_NSLCD           1          /* One segment LCD interface (up to 36x8/40x4) */
#  define KINETIS_NADC16          4          /* Four 16-bit ADC */
#  define KINETIS_NADC12          1          /* One 12-channel ADC (ADC0)*/
#  define KINETIS_NADC13          1          /* No 13-channel ADC (ADC1) */
#  undef  KINETIS_NADC15                     /* No 15-channel ADC */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            4          /* Four Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  undef  KINETIS_NDAC6                      /* No 6-bit DAC */
#  define KINETIS_NDAC12          1          /* One 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  undef  KINETIS_NTIMERS12                  /* No 12 channel timers */
#  define KINETIS_NTIMERS20       4          /* Four 20 channel timers */
#  define KINETIS_NTIMERS12       3          /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK60N512VLL100)
#  undef  KINETIS_K20                        /* Not Kinetis K20 family */
#  undef  KINETIS_K40                        /* Not Kinetics K40 family */
#  define KINETIS_K60             1          /* Kinetis K60 family */
#  define KINETIS_FLASH_SIZE      (512*1024) /* 256Kb */
#  undef  KINETIS_FLEXNVM_SIZE               /* No FlexNVM */
#  undef  KINETIS_FLEXRAM_SIZE               /* No FlexRAM */
#  define KINETIS_SRAM_SIZE       (128*1024) /* 128Kb */
#  define KINETIS_MPU             1          /* Memory protection unit */
#  define KINETIS_EXTBUS          1          /* External bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  define KINETIS_NENET           1          /* One IEEE 1588 Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  define KINETIS_NSDHC           1          /* SD host controller */
#  define KINETIS_NTOUCHIF        1          /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            3          /* Three I2C modules */
#  define KINETIS_NISO7816        1          /* One UART with ISO-786 */
#  define KINETIS_NUART           4          /* Four additional UARTs */
#  define KINETIS_NSPI            3          /* Three SPI modules */
#  define KINETIS_NCAN            2          /* Two CAN controllers */
#  define KINETIS_NI2S            2          /* Two I2S modules */
#  define KINETIS_NSLCD           1          /* One segment LCD interface (up to 36x8/40x4) */
#  define KINETIS_NADC16          4          /* Four 16-bit ADC */
#  define KINETIS_NADC12          1          /* One 12-channel ADC (ADC0)*/
#  define KINETIS_NADC13          1          /* No 13-channel ADC (ADC1) */
#  undef  KINETIS_NADC15                     /* No 15-channel ADC */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            4          /* Four Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  undef  KINETIS_NDAC6                      /* No 6-bit DAC */
#  define KINETIS_NDAC12          1          /* One 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  undef  KINETIS_NTIMERS12                  /* No 12 channel timers */
#  define KINETIS_NTIMERS20       4          /* Four 20 channel timers */
#  define KINETIS_NTIMERS12       3          /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK60N256VML100)
#  undef  KINETIS_K20                        /* Not Kinetis K20 family */
#  undef  KINETIS_K40                        /* Not Kinetics K40 family */
#  define KINETIS_K60             1          /* Kinetis K60 family */
#  define KINETIS_FLASH_SIZE      (256*1024) /* 256Kb */
#  undef  KINETIS_FLEXNVM_SIZE               /* No FlexNVM */
#  undef  KINETIS_FLEXRAM_SIZE               /* No FlexRAM */
#  define KINETIS_SRAM_SIZE       (64*1024)  /* 64Kb */
#  define KINETIS_MPU             1          /* Memory protection unit */
#  define KINETIS_EXTBUS          1          /* External bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  define KINETIS_NENET           1          /* One IEEE 1588 Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  define KINETIS_NSDHC           1          /* SD host controller */
#  define KINETIS_NTOUCHIF        1          /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            3          /* Three I2C modules */
#  define KINETIS_NISO7816        1          /* One UART with ISO-786 */
#  define KINETIS_NUART           4          /* Four additional UARTs */
#  define KINETIS_NSPI            3          /* Three SPI modules */
#  define KINETIS_NCAN            2          /* Two CAN controllers */
#  define KINETIS_NI2S            2          /* Two I2S modules */
#  define KINETIS_NSLCD           1          /* One segment LCD interface (up to 36x8/40x4) */
#  define KINETIS_NADC16          4          /* Four 16-bit ADC */
#  define KINETIS_NADC12          1          /* One 12-channel ADC (ADC0)*/
#  undef  KINETIS_NADC13                     /* No 13-channel ADC */
#  define KINETIS_NADC15          1          /* One 15-channel ADC (ADC1) */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            4          /* Four Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  undef  KINETIS_NDAC6                      /* No 6-bit DAC */
#  define KINETIS_NDAC12          1          /* One 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  undef  KINETIS_NTIMERS12                  /* No 12 channel timers */
#  define KINETIS_NTIMERS20       4          /* Four 20 channel timers */
#  define KINETIS_NTIMERS12       3          /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* CRC */

#elif defined(CONFIG_ARCH_CHIP_MK60X256VML100)
#  undef  KINETIS_K20                        /* Not Kinetis K20 family */
#  undef  KINETIS_K40                        /* Not Kinetics K40 family */
#  define KINETIS_K60             1          /* Kinetis K60 family */
#  define KINETIS_FLASH_SIZE      (256*1024) /* 256Kb */
#  define KINETIS_FLEXNVM_SIZE    (256*1024) /* 256Kb */
#  define KINETIS_FLEXRAM_SIZE    (4*1024)   /* 4Kb */
#  define KINETIS_SRAM_SIZE       (64*1024)  /* 64Kb */
#  define KINETIS_MPU             1          /* Memory protection unit */
#  define KINETIS_EXTBUS          1          /* External bus interface */
#  define KINETIS_NDMACH          16         /* Up to 16 DMA channels */
#  define KINETIS_NENET           1          /* One IEEE 1588 Ethernet controller */
#  define KINETIS_NUSBHOST        1          /* One USB host controller */
#  define KINETIS_NUSBOTG         1          /* With USB OTG controller */
#  define KINETIS_NUSBDEV         1          /* One USB device controller */
#  define KINETIS_NSDHC           1          /* SD host controller */
#  define KINETIS_NTOUCHIF        1          /* Xtrinsic touch sensing interface */
#  define KINETIS_NI2C            3          /* Three I2C modules */
#  define KINETIS_NISO7816        1          /* One UART with ISO-786 */
#  define KINETIS_NUART           4          /* Four additional UARTs */
#  define KINETIS_NSPI            3          /* Three SPI modules */
#  define KINETIS_NCAN            2          /* Two CAN controllers */
#  define KINETIS_NI2S            2          /* Two I2S modules */
#  define KINETIS_NSLCD           1          /* One segment LCD interface (up to 36x8/40x4) */
#  define KINETIS_NADC16          4          /* Four 16-bit ADC */
#  define KINETIS_NADC12          1          /* One 12-channel ADC (ADC0)*/
#  undef  KINETIS_NADC13                     /* No 13-channel ADC */
#  define KINETIS_NADC15          1          /* One 15-channel ADC (ADC1) */
#  undef  KINETIS_NADC18                     /* No 18-channel ADC */
#  define KINETIS_NPGA            4          /* Four Programmable Gain Amplifiers */
#  define KINETIS_NCMP            3          /* Three analog comparators */
#  undef  KINETIS_NDAC6                      /* No 6-bit DAC */
#  define KINETIS_NDAC12          1          /* One 12-bit DAC */
#  define KINETIS_NVREF           1          /* Voltage reference */
#  undef  KINETIS_NTIMERS12                  /* No 12 channel timers */
#  define KINETIS_NTIMERS20       4          /* Four 20 channel timers */
#  define KINETIS_NTIMERS12       3          /* Three 12 channel timers */
#  undef  KINETIS_NTIMERS20                  /* No 20 channel timers */
#  define KINETIS_NRTC            1          /* Real time clock */
#  undef  KINETIS_NRNG                       /* No random number generator */
#  undef  KINETIS_NMMCAU                     /* No hardware encryption */
#  undef  KINETIS_NTAMPER                    /* No tamper detect */
#  define KINETIS_NCRC            1          /* CRC */

